HiennNek/M5MangaS3Plus/sdkconfig.defaults
# M5PaperS3 = ESP32-S3R8, 16MB flash (QIO), 8MB octal PSRAM.
CONFIG_IDF_TARGET="esp32s3"

# Flash
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_FLASHMODE_QIO=y
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_240=y

# Custom partition table (16MB layout, see partitions.csv)
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

# PSRAM (octal, 8MB) - required for full-screen sprites
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SIZE_8MB=y
CONFIG_SPIRAM_USE_MALLOC=y
CONFIG_SPIRAM_MALLOC_ALWAYSINTERNAL=16384
CONFIG_SPIRAM_MALLOC_RESERVE_INTERNAL=32768
CONFIG_SPIRAM_TRY_ALLOCATE_WIFI_LWIP=y

# Optimize for speed (-O2): the per-pixel dithering/JPEG loops need it.
CONFIG_COMPILER_OPTIMIZATION_PERF=y

# 1000Hz tick like the Arduino build (snappier input polling).
CONFIG_FREERTOS_HZ=1000

# Power management: lets DFS scale 80MHz <-> 240MHz automatically.
# compat.cpp additionally holds an esp_pm lock while rendering.
CONFIG_PM_ENABLE=y
CONFIG_PM_DFS_INIT_AUTO=y
CONFIG_FREERTOS_USE_TICKLESS_IDLE=y

# M5Unified still uses the legacy I2C driver internally; silence its EOL note.
CONFIG_I2C_SUPPRESS_DEPRECATE_WARN=y

# HTTP server / WiFi file browser
CONFIG_HTTPD_MAX_REQ_HDR_LEN=1024
CONFIG_HTTPD_MAX_URI_LEN=512
CONFIG_ESP_WIFI_STATIC_RX_BUFFER_NUM=8
